# Zero to mastery Course

The following table is a diagram of the 6 steps of every data science problem

![](6-step-ml-framework.png)

In [15]:
import pandas as pd

ModuleNotFoundError: No module named 'openpyxl'

## 1.- Problem definition
Predict car sales

In [4]:
series = pd.Series(["BMW","Toyota","Honda"])

In [5]:
series

0       BMW
1    Toyota
2     Honda
dtype: object

### Series is 1-dimensional

In [7]:
colors= pd.Series(["Red","Blue","White"])
colors

0      Red
1     Blue
2    White
dtype: object

### Data frame is 2-dimensional

In [11]:
car_Data= pd.DataFrame({"Car make": series, "Color": colors})
car_Data

  Car make  Color
0      BMW    Red
1   Toyota   Blue
2    Honda  White

### Import Data

In [12]:
car_sales = pd.read_csv("car-sales.csv")
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

### EXPORT DATA FRAME AS CSV

In [16]:
car_sales.to_csv("exported-car-sales.csv")

## 2.- Data
This is the data we are using.

### Describe data

In [17]:
# Atritubo
car_sales.dtypes

# Funci√≥n
#car_sales.to_csv()

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [19]:
car_columns= car_sales.columns
car_columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [21]:
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [27]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

### View and select data

In [26]:
car_sales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [29]:
car_sales.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00